Repository: 84000/data-translation-memory
Catalog: toh257-v4.tmx
Source language: bo
Languages: en

source: །རྒྱལ་པོ་མེ་ཏོག་བྲལ་དེའི་བུ་སྲིད་སྒྲུབ་བཅས་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: King Free of Flowers had a son named Arjuna.

source: དེ་ཤིན་ཏུ་འཁོར་བས་སྐྲག་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་རབ་ཏུ་བྱུང་སྟེ་ཕའི་དགེ་འདུན་གྱི་ཀུན་དགའི་ར་བ་དེ་རྗེས་སུ་སྐྱོང་ཞིང་འདུག་གོ།
en: Because of his intense fear of saṃsāra, this son became a renunciate in the presence of the Blessed One, and he then looked after the monastic compound of the saṅgha that his father had donated.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཉན་ཐོས་ཀྱི་དགེ་སློང་གང་དག་གནས་པ་དང་། དེ་ན་གང་དག་བཟའ་བ་དང་། བཏུང་བ་དང་། མལ་ཆ་ལ་ལོངས་སྤྱོད་པར་བྱེད་པ་ཐམས་ཅད་ལ་མེ་ཏོག་བྲལ་གྱི་བུ་དགེ་སློང་སྲིད་སྒྲུབ་བཅས་དེ་ཕྲག་དོག་བྱེད་དོ།
en: Later on, the son of the king Free of Flowers—the monk Arjuna—became jealous of all the hearers of the Blessed One, those monks who were residing there while partaking of food, beverages, and bedding.

source: །བཅོམ་ལྡན་འདས་ཀྱི་ཉན་ཐོས་ཀྱི་དགེ་སློང་དེ་དག་ཀྱང་གནས་དེ་ནས་དོང་ངོ་།
en: Those monks, the hearers of the Blessed One, eventually left the place.

source: །དེ་ཡང་ཡིད་མཆོག་ཏུ་དགའ་ནས་བདག་ཉིད་ཀྱིས་ཀྱང་ལོངས་སྤྱོད་པར་མི་བྱེད། གཞན་དག་ལ་ཡང་མི་སྟེར་རོ་ཞེས་བྱ་བ་ནས་དགེ་སློང་དེ་ཡང་འཆི་བའི་དུས་བྱས་ནས་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་རྣམས་ཀྱི་ནང་དུ་སྐྱེས་སོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: Arjuna was extremely delighted by their departure, but he could neither partake of these provisions himself nor give them away to others.

source: །དེ་ལོ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་མང་པོར་སེམས་ཅན་དམྱལ་བ་ཆེན་པོའི་ནང་དུ་སྐྱེས་ནས་བཙོས་སོ།
en: After he died, that monk was born within the great hells.

source: །དེ་དེ་ནས་ཤི་འཕོས་ནས་ཡི་དགས་རྣམས་ཀྱི་ནང་དུ་སྐྱེས་ཏེ། ལོ་བརྒྱ་སྟོང་ཕྲག་མང་པོར་དེར་སྡུག་བསྔལ་མྱོང་ངོ་།
en: For many trillions of years, he was boiled in those great hells.

source: །ཕྱིས་ཡང་སེམས་ཅན་དམྱལ་བ་དང་ཡི་དགས་རྣམས་ཀྱི་ནང་དུ་སྡུག་བསྔལ་མྱོང་ངོ་།
en: When he finally died and transmigrated from those hells, he was then born among the pretas, where he experienced suffering for many hundreds of thousands of years.

source: །ལག་འགྲོ་འཁོར་བས་སྐྲག་པའི་སེམས་དང་ལྡན་པའི་སྲིད་སྒྲུབ་བཅས་ཞེས་བྱ་བ་རབ་ཏུ་བྱུང་སྟེ།
en: After that, he again experienced further suffering among hell beings and pretas.

source: དེ་ནས་ཤི་འཕོས་ནས་དེ་ལྟར་ཡུན་རིང་པོར་ངན་སོང་གསུམ་དུ་སྡུག་བསྔལ་མྱོང་བ་དེ་གཞན་ཞིག་ཡིན་པར་ཁྱོད་སེམས་ན། གཞན་ཡིན་པར་བལྟ་བར་མི་བྱ་སྟེ།
en: “Nāga, if you think that this person Arjuna—who became a renunciate out of fear of saṃsāra and then suffered in the three lower realms for such a long time after he died—was anyone else, then you should not think that!

source: དེ་ལྟར་ལས་ཀྱི་སྒྲིབ་པ་དམ་པོས་ཟིན་པ་ཡང་ཁྱོད་ཡིན་ནོ།
en: Because it is you who are afflicted by such strong karmic obscurations.

source: །འདི་ཕན་ཆད་བསྐལ་པ་སུམ་ཅུ་རྩ་གཅིག་ཏུ་ཁྱོད་རྟག་པར་ངན་སོང་གསུམ་གྱི་ནང་དུ་སྐྱེས་སོ།
en: From then on and for thirty-one eons, you have continuously been born in the three lower realms.

source: །དེའི་ལས་ཀྱི་སྒྲིབ་པ་ལྷག་མ་ལུས་པ་དེས་འདིར་ཀླུ་རྣམས་ཀྱི་ནང་དུ་སྐྱེས་པ་ནི་གཞན་མ་ཡིན་གྱི་ཁྱོད་ཡིན་ཏེ། སྡུག་བསྔལ་གྱི་ཚོར་བ་དེ་ལྟ་བུ་མྱོང་ངོ་།
en: Due to the residue of those karmic obscurations, you have now been born among the nāgas. It was you who experienced those sufferings and no one else.

source: །གང་ཁྱོད་འདི་ནས་ཤི་འཕོས་ནས་ཕྱིས་ཀྱང་སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོ་དང་། ཡི་དགས་རྣམས་ཀྱི་ནང་དུ་རྟག་ཏུ་སྡུག་བསྔལ་གྱིས་གཟིར་བར་འགྱུར་བ་འདི་ནི་གནས་ཡོད་དོ།
en: In the future, after you die, it is likely that you will again be tormented continuously by suffering among the hell beings, animals, and pretas.”

source: །ཀླུའི་བུ་དེ་མཆོག་ཏུ་ཡིད་མི་དགའ་ནས་རབ་ཏུ་ངུ་ཞིང་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་ཕྱག་འཚལ་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་བྱིས་པ་ཇི་ལྟ་བ་དང་། རྨོངས་པ་ཇི་ལྟ་བ་དང་། མི་གསལ་བ་དང་། མི་མཁས་པ་ཇི་ལྟ་བ་བཞིན་དུ་ནོངས་པ་སོ་སོར་འཆགས་ལགས་སོ་ནོངས་པ་སོ་སོར་འཆགས་ལགས་སོ།
en: Utterly distressed, the nāga started to weep. He prostrated to the feet of the Blessed One and exclaimed, “Respected Blessed One, I confess all the faults I have committed out of foolishness, delusion, confusion, and lack of intelligence! I confess each of my faults!

source: །བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་གི་བསམ་པས་སྡོམ་པ་གཟུང་བར་བགྱིའོ།
en: Respected Blessed One, I will embrace the vows willingly!

source: །བདག་དེ་བཞིན་གཤེགས་པའི་དགེ་བསྙེན་ལགས་ཏེ།
en: I wish to be a lay practitioner of the Thus-Gone One!

source: ཇི་སྲིད་འཚོའི་བར་དུ་སྲོག་གཅོད་པ་སྤངས་པ་ལགས་སོ།
en: I will renounce killing for as long as I live!

source: །བདག་བཅོམ་ལྡན་འདས་ལ་སྐྱབས་སུ་མཆིས་པ་ལགས་སོ།
en: I go for refuge in the Blessed One!”

source: །ཁྱོད་ལྷག་པའི་བསམ་པས་ང་ལ་སྐྱབས་སུ་སོང་བས་ཁྱོད་ཀྱི་ངན་སོང་ཐམས་ཅད་ཡོངས་སུ་ཟད་དོ།
en: Since you have gone for refuge in me with such determination, all the lower realms are now exhausted for you.

source: །འདི་ནས་ཤི་འཕོས་ནས་ཁྱོད་ཀྱིས་བྱམས་པའི་ཚེ་ན་མིའི་རྙེད་པ་ཐོབ་པར་འགྱུར་ཏེ།
en: After you die, you will achieve a human body during the time of Maitreya.

source: བྱམས་པའི་ཐད་དུ་རབ་ཏུ་འབྱུང་བར་འགྱུར་ཞིང་དགྲ་བཅོམ་པ་ཉིད་ཀྱི་བར་དུ་མངོན་སུམ་དུ་བྱེད་པར་འགྱུར་རོ།
en: You will become a renunciate in the presence of Maitreya and actualize the fruitions up to the level of the worthy ones.

source: །དེའི་ཚེ་དེའི་དུས་ན་གང་གིས་གཙུག་ཏོར་ཅན་འཁོར་དང་བཅས་པ་ལ་ཟླ་བ་གསུམ་དུ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་རིམ་གྲོ་བྱས་པ་དང་། དེའི་ཕྱིར་དགེ་འདུན་གྱི་ཀུན་དགའ་ར་བ་ཡོ་བྱད་ཐམས་ཅད་ཕུན་སུམ་ཚོགས་པར་བྱས་པའི་རྒྱལ་པོ་མེ་ཏོག་བྲལ་ཞེས་བྱ་བ་གཞན་ཞིག་ཡིན་པར་ཁྱོད་སེམས་ན་དེ་གཞན་ཡིན་པར་ཡང་མི་བལྟ་སྟེ། དེ་ནི་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་འདི་ཡིན་ནོ།
en: King Free of Flowers, who at that time revered Śikhin and his retinue for three months by offering all sorts of supplies and built a fully functional monastic compound for the saṅgha, was no one but this very nāga king Sāgara. Do not think that this was someone else!

source: །འདི་ནི་བསྐལ་པ་སུམ་ཅུ་རྩ་གཅིག་ཏུ་ནམ་ཡང་ངན་འགྲོར་མ་སྐྱེས་སོ། །ལྷའི་དཔལ་དང་སྐལ་བ་བཟང་པོ་ཕུན་སུམ་ཚོགས་པ་ཤིན་ཏུ་རྒྱ་ཆེན་པོ་མྱོང་ངོ་།
en: For thirty-one eons, he was never born in the lower realms but instead experienced divine glory and excellent fortune on an extremely vast scale.

source: །འདི་ནི་བླ་ན་མེད་པའི་ཐེག་པའི་ཕྱིར་སྨོན་ལམ་གྱི་དབང་གིས་འདིར་ཀླུ་རྣམས་ཀྱི་ནང་དུ་སྐྱེས་ཏེ། འདིར་དཔལ་དང་སྐལ་བ་བཟང་པོ་དེ་ལྟ་བུ་མྱོང་ངོ་།
en: He was born here among the nāgas through the power of his aspirations for the unsurpassed vehicle, and he now experiences such glory and fortune in this place.”

source: །དེ་སྐད་ཅེས་ཐོས་ནས་ཀླུ་ཐམས་ཅད་སྐྱོ་ཞིང་མཆོག་ཏུ་ཡིད་མི་བདེ་ནས་བཅོམ་ལྡན་འདས་ལ་མཆོག་ཏུ་གུས་པ་སྐྱེས་ཤིང་ཉེ་བར་རྟོག་པས་གཅེས་པར་བྱེད་པར་གྱུར་ཏོ།
en: When they heard those words, all the nāgas became weary and extremely unhappy. They developed the utmost respect and fondness for the Blessed One.

source: །དེའི་ནང་ན་ཀླུ་གཞན་མིག་མེད་པ་ལོང་བ་འབྲས་བུ་ཉམ་ཆུང་བ་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: Among the nāgas, there was one nāga named Feeble Fruit, who was blind.

source: དེས་གསང་བསྟོད་ནས་འོ་དོད་བོས་ཏེ་གསོལ་པ། སེམས་ཅན་རྣམས་ལ་ཐུགས་བརྩེ་བདག་ཅག་ཡོངས་སུ་བསྐྱབ་པར་གསོལ།
en: He started to lament loudly, “You who are affectionate toward sentient beings, please protect us!

source: །ཡུན་རིང་བདག་གི་ལུས་ལ་སྡུག་བསྔལ་ཚོར་བ་རབ་མི་བཟད།
en: For a long time, I have had the most terrible physical sufferings.

source: །སྲིན་བུ་སྦལ་པ་སྐྱེ་བོ་སྲོག་ཆགས་སྣ་ཚོགས་འཚལ་བར་བགྱིད།
en: Worms, bugs, and all kinds of other creatures are devouring me.

source: །བཟའ་བ་བཏུང་བ་མ་མཆིས་ཆབ་ཚན་ནང་ན་བདག་གནས་ལགས།
en: I lack food and drink and am living in boiling water!”

source: འཁོར་བ་འཇིག་རྒྱལ་བསྟན་པ་ལ། །སྔོན་ནི་དགེ་སྦྱོང་ཁྱོད་གྱུར་ཏོ།
en: “In the past, you were a spiritual practitioner Under the teachings of the Victor Krakucchanda.

source: །མཁས་ཤིང་གཙང་སྦྲ་སྤྱོད་ལམ་ལྡན།
en: You were learned and practiced the conduct of cleanliness,

source: །དབེན་པ་དག་ཏུའང་སྡིག་པ་བྱེད།
en: But you also committed negative deeds in seclusion.

source: །ལྷན་ཅིག་གནས་པ་དག་ཀྱང་མང་།
en: “You had many followers,

source: །ཁྱོད་བདག་སྟོན་པ་འདྲ་བར་གྱུར། །
en: And you became a teacher like myself.

source: དགྲ་བཅོམ་རྫུ་འཕྲུལ་ཆེན་པོ་ཡང་། །ཁྱོད་ལ་སློབ་མ་རྣམས་ཀྱིས་བརྗོད།
en: Your disciples praised you As a worthy one endowed with great magical powers.

source: །རྙེད་དང་བཀུར་སྟི་བྱུང་བ་ནི།
en: “Whenever wealth and meals appeared,

source: །ཁྱོད་གཅིག་བུ་ཡིས་ལོངས་སྤྱད་ཅིང་།
en: You partook of it alone.

source: །ཁྱོད་ཀྱིས་དགེ་སློང་དེས་པ་མཐོང་། །དེ་དག་ལ་ནི་མི་སྙན་བརྗོད།
en: You abused gentle monks Upon seeing them.

source: །ལྷན་ཅིག་གནས་དེ་མི་དགར་གནས།
en: “You did not enjoy living among others,

source: །ཁྱོད་ནི་ཚེ་རབས་སྟོང་དག་ཏུ། །ངེད་ཀྱི་ཟས་སུ་གྱུར་ཅིག་ཅེས། །དེ་ལྟ་བུ་ཡི་སེམས་བསྐྱེད་དོ།
en: And for a thousand lifetimes, You entertained the thought ‘May this be my food!’

source: །ལས་ཀྱི་རྣམ་པར་སྨིན་པ་དེས།
en: “Due to the ripening of that karmic action,

source: །འདིར་ཡང་ཁྱོད་ནི་ལག་འགྲོར་སྐྱེས།
en: You were born here as a nāga,

source: །ཁྱོད་རང་གི་ཡང་ལྷན་ཅིག་གནས།
en: And those creatures living on your body

source: །ཕྱི་ཕྱིར་ཟ་བར་བྱེད་པ་ཡིན།
en: Are now constantly feeding on you.

source: །ཆུ་ཚན་ནང་ན་གནས་པ་དང་། །ལོང་བར་དེ་ཡིས་གྱུར་པ་ཡིན།
en: “You are therefore living in boiling water, And you have become blind.

source: །ཀུན་ཏུ་འབར་བའི་ལྕགས་དང་ཟངས། །ཕྱིས་ཀྱང་དམྱལ་བར་ཟ་བར་འགྱུར།
en: In the future, you will eat Burning iron and copper in hell.

source: །སྟོབས་མེད་ཡིད་ནི་མི་དགའ་བས།
en: “Without strength and filled with distress,

source: །ཀླུ་དབང་ཀུན་གྱི་ནང་ན་ངུ་།
en: You are now weeping among the nāga lords,

source: །ཉེས་པ་སོ་སོར་བཤགས་བྱས་ན།
en: But if you confess each of your faults,

source: །སྡུག་བསྔལ་རྣམས་ལས་ཡོངས་སུ་གྲོལ།
en: You shall be freed from your sufferings.”

source: །དེ་ནས་བཅོམ་ལྡན་གསེར་འདྲ་བའི། །ཕྱག་གི་མཐིལ་གྱི་དཀྱིལ་འཁོར་རེག །སྤྱོད་པར་དཀའ་བ་དགོངས་མཛད་ནས།
en: The Blessed One then touched his face With his gold-like hand. Considering the hardships he had undergone,

source: །སྟོན་པས་འདི་སྐད་བཀའ་སྩལ་ཏོ།
en: The Teacher then said,

source: །རྒྱལ་པོ་མིག་བཟངས་ང་བྱུང་སྟེ། །སྔོན་ཚེ་བདེན་པ་གང་གིས་ངས། །བྲམ་ཟེ་ལོང་བའི་དོན་དུ་ནི། །མིག་དག་གཉིས་ཀ་ཕྱུང་བར་གྱུར།
en: “When I was the king Excellent Eyes, I once removed both my eyes For the sake of a blind brāhmaṇa, With these words of truth.

source: །བདེན་པའི་ཚིག་དེ་ཁོ་ན་ཡིས། །ཁྱོད་ཀྱིས་དྲི་མེད་མིག་ཐོབ་ཤོག །
en: “With those exact words of truth, May you gain faultless eyes!

source: ང་ཡི་ལེགས་པར་སྤྱོད་པས་ཁྱོད། །སྔོན་གྱི་ལས་དེ་བྱང་བར་ཤོག །
en: Through my excellent conduct, May your past actions be purified!”

source: ཏདྱ་ཐཱ། ཙཀྵུ་ཁ་བ། ར་ས་ན་ཁ་བ། ཀརྨ་ཁ་བ། ཨ་ནན་ཛ་ན། བི་ར་ཛ། བ་ར་ཨན་ཏ། ཛྙཱ་མ། ནི་ས་ར་ཎ་ཏྲོ་ཡ། ཨ་ཧེ་ཙན་དྲ་ཌ་ནེ་ཀྲི་མི་ཤུད་དྷེ། ཕ་ལ་ཤུད་དྷེ། ཨ་ཛེ་ཏ་ཛེ། ཏ་ལེ་ཏན་ཏ་ལེ། བ་སེ་དྷ་ས་ཀེ། བ་ས་ཏེ། རཱུ་ར་ཏི། མ་ཧཱ་རཱུ་ར་བི། ཏྲི་རད་ན་བྲ་ཏེ་སྭཱ་ཧཱ།
en: tadyathā: cakṣukhava rasanakhava karmakhava ananjana viraja vara anta jñāma nisaraṇatroya a he candra ḍane krimi śuddhe phal śuddhe aje taje tale tantale vasedhasake vasate rūrati mahārūravi triratnaprate svāhā.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བདེན་པའི་ཚིག་དེ་བཤད་པ་ན་ཀླུ་འབྲས་བུ་ཉམ་ཆུང་བའི་མིག་ཡོངས་སུ་དག་པར་གྱུར་ཏོ། །ཀླུ་གཞན་སྟོང་ཕྲག་ལྔ་བཅུ་རྩ་གསུམ་གྱི་མིག་ཀྱང་ཡོངས་སུ་དག་པར་གྱུར་ཏོ།
en: As those words of truth were uttered by the Blessed One, the eyes of Feeble Fruit became immaculate, as did the eyes of fifty-three thousand other nāgas.

source: །གཞན་གནོད་སྦྱིན་དང་། གྲུལ་བུམ་དང་། ཡི་དགས་དང་། ཤ་ཟ་དང་། མི་ཁྲག་ཁྲིག་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་ནི་སྔོན་གྱི་ལས་ཀྱི་སྒྲིབ་པ་ཟད་ཅིང་མིག་ཡོངས་སུ་དག་པར་གྱུར་ཏོ།
en: Furthermore, the previous karmic obscurations of eight billion four hundred million yakṣas, kumbhāṇḍas, pretas, piśācas, and humans were exhausted, and their eyes also became immaculate.

source: །དེ་ནས་ལྷའི་བུ་མཚམས་བཟངས་ཐལ་མོ་རབ་ཏུ་སྦྱར་བ་བྱས་ནས་སྨྲས་པ། འཇིག་རྟེན་འདྲེན་པ་རྣམས་ཀྱི་སྟོབས་ལ་ལྟོས།
en: The god Susīma joined his palms and exclaimed, “Look at the power of the leaders of the world!

source: །རབ་ཏུ་ལམ་མེད་རྣམས་ལ་མིག་ཀྱང་བྱིན།
en: They give their eyes to those who do not see the path.

source: །གལ་ཏེ་སྟོན་པ་འཇིག་རྟེན་མི་འབྱུང་ན། །སུ་ཡང་འགྲོ་བར་ཤའི་མིག་ཕྱིས་མི་འཐོབ།
en: If the teachers do not appear in the world anymore, in the future no one will achieve eyes of flesh with which to proceed!”

source: །དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་ཤེས་ཀཽ་ཌི་ནྱ་ལ་བཀའ་སྩལ་པ།
en: At that moment, the Blessed One said to Venerable Ājñātakauṇḍinya,

source: ཀཽ་ཌི་ནྱ་ཁྱོད་ཀྱིས་གསང་སྔགས་ཆེན་པོའི་གཞིའི་གཟུངས་སྔགས་མིག་སྒྲུབ་པ་འདི་ཟུང་ཤིག །
en: “Kauṇḍinya, remember this dhāraṇī mantra—this great mantra formula—that accomplishes vision.

source: ད་ལྟར་དང་མ་འོངས་པའི་དུས་ན་སུ་ལ་ལ་སེམས་ཅན་རྣམས་ཀྱི་སྔོན་གྱི་ལས་ཀྱི་ལྷག་མ་དང་། ཁམས་ཀུན་ཏུ་འཁྲུགས་པ་དང་། གསང་སྔགས་དང་། སྨན་དང་། དུག་གི་སྦྱོར་བས་ལོང་བར་འགྱུར་བ་དང་། ཆུང་ཟད་མཐོང་བར་ཡང་འགྱུར་བ་དེས་མིག་སྒྲུབ་པའི་གཟུངས་སྔགས་འདི་རང་གིས་བཀླག་པར་བྱའོ། །རང་གི་ལས་སོ་སོར་བཤགས་པར་བྱའོ།
en: Now and in the future, all the sentient beings who become blind or develop poor eyesight due to the residue of past karmic actions, disturbances of the elements, mantras, medicines, or poison should read aloud this dhāraṇī mantra that accomplishes vision and confess each of their actions.

source: །དེས་སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པའི་སེམས་ཀྱིས་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་བསྒོམ་ཞིང་ལས་གཞན་མི་བྱེད་པར་ཞག་བདུན་ཕྲག་བདུན་དུ་རང་གི་མིག་ལ་བྱབས་ན་མིག་ཡོངས་སུ་དག་པར་འགྱུར་རོ།
en: If for seven weeks they wipe their eyes while cultivating the recollection of the Buddha with a loving attitude toward all beings and without doing anything else, their eyes will become immaculate.

source: །ཡང་སེམས་ཅན་གང་དག་མཚམས་མེད་པའི་ལས་ལྷག་མ་ལུས་པས་ལོང་བར་གྱུར་ཅིང་དམ་པའི་ཆོས་སྤོང་བའི་ལྷག་མ་ལུས་པ་དང་། འཕགས་པ་ལ་སྐུར་པ་འདེབས་པའི་ལྷག་མ་ལུས་པ་དང་། ཆོས་ཀྱི་སྦྱིན་པའི་སྒྲིབ་པའི་ལྷག་མ་ལུས་པ་དང་། གླེགས་བམ་དུ་བྲིས་པ་རྣམ་པར་འཇིག་པའི་ལྷག་མ་ལུས་པ་དང་། གཞན་གྱི་མིག་རྣམ་པར་འཇིག་པའི་ལས་ཀྱི་ལྷག་མས་ལོང་བར་གྱུར་པ་དེ་དག་གིས་གཟུངས་སྔགས་འདི་ཡི་གེར་འདྲིར་བཅུག་སྟེ། ཡང་དང་ཡང་དུ་ཀློག་ཏུ་གཞུག་གོ།
en: People should commission this dharaṇī mantra to be written down and repeatedly read aloud if they have become blind due to the residual karmic actions related to the acts with immediate retribution, the residual karmic action of rejecting the sacred Dharma, the residual karmic action of denigrating noble beings, the residual karmic action of blocking generosity of the Dharma, the residual karmic action of destroying books, or the residual karmic action of destroying others’ eyes.

source: །ལས་ཀྱི་སྒྲིབ་པ་བཤགས་པར་བྱའོ།
en: They should also confess their karmic obscurations.

source: །གཞན་ཡང་རྒྱ་མཚོའི་ལྦུ་བ་དང་། ཤིང་མངར་དང་། སྨན་ཀ་ཙ་དང་། འབྲས་བུ་གསུམ་དང་། རུས་སྦལ་གྱི་སྙིང་རྙིང་པ་སྦྲང་རྩི་དང་ལྷན་ཅིག་བཏག་ཅིང་བཙོས་ལ་གསང་སྔགས་འདི་དག་ལན་སྟོང་རྩ་བརྒྱད་མངོན་པར་བརྗོད་ཅིང་མིག་གི་ཕྱི་རོལ་དུ་བསྐུ་བར་བྱའོ།
en: Furthermore, they should blend together ocean foam, licorice, kaca herb, the three medicinal fruits, dried turtle heart, and honey. It should then be cooked and smeared around the eyes while they read aloud the words of this mantra one thousand and eight times.

source: །ཞག་བདུན་ཕྲག་བདུན་དུ་ལས་གཞན་མི་བྱེད་པར་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་བསྒོམ་ཞིང་སངས་རྒྱས་ཀྱི་སྐུ་གཟུགས་ཀྱང་བྱས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་མ་ལུས་པར་བྱང་བར་འགྱུར་ཞིང་དེའི་མིག་ཡོངས་སུ་དག་པར་འགྱུར་རོ།
en: If for seven weeks they cultivate the recollection of the Buddha and produce images of the Buddha without doing anything else, all their karmic obscurations will be purified, and their eyes will become immaculate.

source: །གཞན་ཡང་དགེ་སློང་རྣམས་ཀྱི་གནས་དགེ་འདུན་གྱི་ཀུན་དགའ་ར་བ་བྱས་ན་ཡང་དེའི་ལས་ཀྱི་སྒྲིབ་པར་བྱང་བར་འགྱུར་རོ། །ཕྱིས་ཀྱང་འཁོར་བར་མིག་མ་ཚང་བར་མི་འགྱུར་རོ།
en: If they build a monastic compound for the saṅgha where monks can reside, their karmic obscurations will also be purified, and later on their eyes will never be impaired within saṃsāra.”

source: །དེ་ནས་ཐམས་ཅད་དང་ལྡན་པའི་ཀླུའི་འཁོར་དེས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །ཐུགས་རྗེ་ཆེན་པོ་དང་ལྡན་པ་དུས་གསུམ་གྱི་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པར་མཛད་པ་ནད་ལས་རབ་ཏུ་ཐར་བར་མཛད་པ་ལ་ཕྱག་འཚལ་ལོ།
en: The entire retinue of nāgas exclaimed, “Great compassionate one, benefactor of all beings in the three times, healer of all diseases, we pay homage to you!”

source: །དེ་ནས་དེའི་ཚེ་ཀླུ་ཚོན་རྩི་སྔོན་པོས་གསང་བསྟོད་དེ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: The nāga Blue Color then started to lament loudly:

source: །སྡིག་པ་ཐམས་ཅད་སྦྱོང་བ་ཁྱོད།
en: “You purify all negative deeds,

source: །ཁྱོད་ནི་དཀའ་མཛད་དཔལ་ཀུན་ལྡན།
en: You have performed austerities, You are endowed with all splendor,

source: །ཁྱོད་ཀྱིས་ལས་ཀྱང་རབ་ཏུ་མཁྱེན། །སྲོག་ཆགས་ཀུན་གྱི་རྒྱལ་པོ་ཁྱོད།
en: You know all actions, and you are the king of all beings.

source: །བདག་ནི་ཆུ་དང་རྣམ་བྲལ་ཞིང་། །ཚ་བའི་ཀླུང་གིས་ཀུན་གདུངས་པའི། །འབྲོག་དགོན་པ་ན་གནས་པ་ལགས། །
en: “I am lacking water. I live in the wilderness, Where I am tormented by scorching winds, And I reside in stinking places.

source: དྲི་མི་ཞིམ་པའི་གནས་ན་གནས། །ལོ་ནི་བྱེ་བ་ཕྲག་སྟོང་དུ། །ཞག་གཅིག་བདག་ལ་བདེ་མ་མཆིས། །རྟག་པར་འཁོར་དང་ལྷན་ཅིག་ཏུ། །བདག་ནི་གཞན་གྱིས་བཟའ་བ་ལགས།
en: “I have not experienced a single day of happiness In ten billion years, And my retinue and I Are constantly devoured by others.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Blessed One replied:

source: །སེམས་ཅན་གང་དག་སྡིག་བྱས་ནས།
en: “There are beings who commit negative deeds

source: །ཕྱིས་ཀྱང་བདག་ཉིད་བསོད་ནམས་སྒྲུབ། །
en: But accomplish merit later on.

source: ལུས་ཀྱིས་གཎྜཱི་བརྡུངས་ནས་སུ། །དགེ་སློང་དགེ་འདུན་ཚིམ་བྱེད་ནའང་། །ལས་ཀྱི་ལྷག་མ་དེ་ཡིས་སུ། །གང་དང་གང་དུ་སྐྱེས་པར་ནི། །སྡུག་བསྔལ་ཅི་འདྲ་འབྱུང་འགྱུར་ཞིང་། །བཟའ་བཏུང་དག་དང་ཡང་དག་ལྡན།
en: Even if they physically feed the saṅgha of monks After beating the gong, “Through the residue of their former karmic action, They will undergo much suffering Wherever they are born, Yet they will not lack food and drink.

source: །ཡང་ན་ཀླུ་ཡི་སྐྱེ་གནས་སུ། །ལུས་ཀྱིས་སྐྱེ་བར་འགྱུར་བ་ཡིན།
en: “Alternatively, they will be born As nāgas due to their karmic actions,

source: །དེ་ཡི་མགོ་ཡི་ཀླད་པ་དེར།
en: And the tops of their heads

source: །ནོར་བུའི་རྒྱལ་པོ་འབྱུང་བར་འགྱུར།
en: Will be adorned by the king of jewels.

source: །ཀུན་ཏུ་ཆུ་འབྱུང་ཞེས་བྱ་བ།
en: “As nāgas who give water,

source: །ཆུ་སྦྱིན་བྱེད་པའི་ཀླུར་འགྱུར་རོ།
en: They are known as the source of water.

source: །གང་ན་ཀླུ་ནི་གནས་བྱེད་པ། །དེ་ནས་ཆུ་ནི་འབབ་པར་འགྱུར།
en: Water will flow In the places where those nāgas reside.

source: །ས་འམ་ནམ་མཁའ་ལ་ཡང་རུང་། །གང་དང་གང་དུ་འགྲོ་བ་དེར། །སེམས་ནི་བསྐྱེད་མ་ཐག་ཏུ་ཡང་། །ཆུ་ནི་འབྱུང་བར་འགྱུར་བ་ཡིན།
en: “Wherever they go— Whether on earth or in the sky—Water will appear As soon as they think about it.

source: །ཡང་ན་སེམས་ཅན་གང་དག་གིས།
en: “There are also sentient beings

source: །མི་ཡི་དངོས་པོ་ཐོབ་ནས་སུ།
en: Who have obtained a human body,

source: །སྡིག་པ་རྣམ་པ་སྣ་ཚོགས་བྱས།
en: Although they committed a variety of negative deeds.

source: །དགེ་འདུན་རིམ་གྲོ་མི་བྱེད་ན།
en: If they do not revere the Saṅgha,

source: །དེ་དག་སྡུག་བསྔལ་སྣ་ཚོགས་ནི།
en: “They will experience all kinds of suffering

source: །ངན་སོང་གསུམ་དུ་མྱོང་ནས་ཀྱང་།
en: In the three lower realms.

source: །དེ་ཉིད་ཀླུ་ཡི་སྐྱེ་གནས་སུ། །སྐྱེ་བ་ཐོབ་པར་འགྱུར་བ་ཡིན།
en: They will then attain birth In the realm of the nāgas.

source: །དེ་ལས་ཀུན་ཏུ་ཆུ་མི་འབྱུང་།
en: “Water will not appear to them,

source: །མགོ་ལ་ནོར་བུ་རིན་ཆེན་མེད།
en: And there will be no precious gem adorning their heads.

source: །སྟོང་པ་སྐོམ་པའི་གནས་དག་ཏུ།
en: They will live in dry and barren places

source: །ཆུ་མེད་པར་ནི་གནས་པར་འགྱུར།
en: Without any water.

source: །སྔོན་འདས་དུས་ན་ཁྱོད་ཀྱིས་ནི། །རྒྱལ་བ་སྐར་རྒྱལ་བསྟན་པ་ལ། །དགེ་སློང་དགོན་པ་པར་གྱུར་ཏེ།
en: “In the past you were A forest-dwelling monk Under the teachings of the Victor Tiṣya.

source: །ཕྲག་དོག་སེར་སྣས་གང་བ་ཡིན།
en: You were filled with envy and miserliness.

source: །དགེ་སློང་བློ་བུར་འོངས་མཐོང་ནས། །ཁྲོ་གཉེར་ཅན་གྱི་བཞིན་བྱས་ནས། །དེ་དག་ལ་ནི་སྦྱིན་གཏོང་བྱེད། །དེ་ལ་ཡང་ནི་མངོན་སུམ་གཤེ།
en: “When you saw monks begging for alms, You offered them gifts With a grimacing face, And you criticized them openly.

source: །དེར་ནི་གང་དག་ཆུར་ཡང་ནི། །མྱུར་དུ་མི་གཙང་བ་ཡིས་བཀང་། །འཆག་ས་གནས་ཁང་དག་གི་གནས། །དྲི་ང་བ་ཡིས་བཀང་བར་གྱུར།
en: “You even filled their water discretely With impure substances, And you covered the paths they were walking on With stinking substances.

source: །དགེ་སློང་དེས་པ་འགྲོ་བ་ན།
en: “When gentle monks passed by,

source: །བརྒྱད་བཀག་གིས་ནི་གཤེ་བར་གྱུར།
en: You abused them with rebukes,

source: །དགེ་སློང་དེས་པ་གཞན་དག་ཀྱང་། །རྒྱང་རིང་བར་ནི་ཡོངས་སུ་སྤངས།
en: And you also rejected Other gentle monks far away.

source: །དེ་ཕྱིར་ཕྲག་དོག་སེར་སྣའི་རྒྱུས།
en: “Through such envy and miserliness,

source: །མ་ཆོད་པར་ནི་ཁྱོད་གྱུར་ནས།
en: You swiftly and angrily abused

source: །དགེ་སྦྱོང་སུ་ཞིག་ལ་ལ་མཐོང་།
en: All the spiritual practitioners you met,

source: །མྱུར་དུ་ཁྲོས་ནས་གཤེ་བར་འགྱུར།
en: And you did this continuously.

source: །སྦྱིན་པ་པོ་ལ་ཁྲོ་བས་གཤེ།
en: “You angrily criticized benefactors,

source: །ངོ་ཚ་ཁྲེལ་ཡོད་རྣམ་པར་སྤངས།
en: And you gave up all humility and modesty.

source: །སེམས་ཅན་དམྱལ་བར་སོ་སོར་སྐྱེས།
en: You were born as a hell being.

source: །ལུས་ནི་བྱེ་བས་སེམས་དམྱལ་དུ། །སྡུག་བསྔལ་མང་པོ་ཉམས་སུ་མྱོང་།
en: “You experienced a lot of suffering in the hell realms, In ten million different bodies.

source: །ཡི་དགས་རྣམས་སུ་དུས་རིང་པོར། །སྡུག་བསྔལ་རབ་ཏུ་མི་བཟད་མྱོང་།
en: You also experienced unbearable suffering Among the pretas for a very long time.

source: །ཁྱོད་ནི་ཀླུ་ཡི་སྐྱེ་གནས་སུ། །སྐྱེས་ནས་ཤིན་ཏུ་སྡུག་བསྔལ་གྱུར། །
en: “You have now suffered a lot Since you were born as a nāga.

source: སྟོང་པ་འབྲོག་དགོན་རྫོང་རྣམས་སུ། །ཆུ་དང་བྲལ་བར་གནས་པ་ཡིན།
en: You are living without water In barren, isolated regions.

source: །སེམས་ཅན་དམྱལ་བ་རྣམས་སུ་ཁྱོད། །སྡུག་བསྔལ་ཚོར་བ་ཕྱི་ཕྱིར་མྱོང་། །ཤིན་ཏུ་ཡུན་རིང་ཡི་དགས་དང་། །དུད་འགྲོར་སྡུག་བསྔལ་ཚོར་བ་མྱོང་།
en: “You will again and again experience Feelings of suffering in the hell realms, And you will still experience feelings of suffering Among the pretas and animals for a very long time.

source: །སུ་ཞིག་ཐ་མའི་དུས་ཚེ་གནོད་སེམས་བྱུང་།
en: “Those who, during the final period, give rise to ill will

source: །རྟག་ཏུ་ཕྲག་དོག་སེར་སྣ་ཁྲོས་པ་ལ།
en: And are constantly envious, miserly, and angry

source: །བསམ་གཏན་མི་སྐྱོབ་སངས་རྒྱས་མཆོད་པ་མིན།
en: Will neither guard their concentration nor worship the buddhas.

source: །ཚུལ་ཁྲིམས་མི་སྐྱོབ་དགོན་པར་གནས་པ་མིན།
en: They will neither guard their discipline nor reside in the forest.”

source: །ཡང་དེའི་ཚེ་ཀླུའི་འཁོར་དེའི་ནང་ན་ཀླུ་ཡི་དགས་ལྟ་བུ་བྱེ་བ་ཕྲག་ཉི་ཤུ་རྩ་དྲུག་སྔོན་གྱི་ཚེ་རབས་རྗེས་སུ་དྲན་པར་གྱུར་ཏེ།
en: At that moment, within that retinue of nāgas, two hundred sixty million nāgas who were like pretas remembered their past lives.

source: སྐད་པོ་ཆེར་རབ་ཏུ་ངུ་ཞིང་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཅག་ཡོངས་སུ་བསྐྱབ་ཏུ་གསོལ།
en: They started to weep loudly and said, “Blessed One, please protect us!

source: བདེ་བར་གཤེགས་པ་བདག་ཅག་ཡོངས་སུ་བསྐྱབ་ཏུ་གསོལ།
en: Well-Gone One, please protect us!

source: སྔོན་གྱི་རྒྱལ་བའི་བསྟན་པ་ལ་བདག་ཅག་གིས་འདྲ་མཚུངས་པར་ལས་ཀྱི་སྒྲིབ་པ་དེ་ལྟ་བུ་འཕངས་ལགས་སོ། །དེ་ལྟར་ཡུན་རིང་པོར་ངན་སོང་གསུམ་དུ་སྡུག་བསྔལ་མྱོང་ལགས་སོ།
en: We have produced the same karmic obscurations under the teachings of previous victors, and we have therefore suffered in the three lower realms for a long time.

source: །ད་ལྟར་ཡང་ཀླུ་ཡི་དགས་ལྟ་བུ་རྣམས་ཀྱི་ནང་དུ་རྟག་ཏུ་སྡུག་བསྔལ་དེ་ལྟ་བུས་གཟིར་ལགས་ཏེ།
en: We are now constantly tormented by such sufferings among the nāgas who are like pretas.

source: དཔེར་ན་ཀླུ་ཡི་དགས་ལྟ་བུ་ཚོན་རྩི་སྔོན་པོ་བཞིན་ནོ།
en: We are just like the nāga Blue Color, who is also like a preta.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཁྱོད་ཀྱིས་ཆུ་ལོང་ལ་དེ་བཞིན་གཤེགས་པའི་ཞབས་ཀྱི་དྲུང་དུ་ཆག་ཆག་ཐོབ་ཤིག་དང་། དེས་ནི་ཁྱེད་ཀྱི་སྡུག་བསྔལ་ཐམས་ཅད་ཡོངས་སུ་ཟད་པར་འགྱུར་རོ།
en: The Blessed One replied, “Take some water and sprinkle it on the Thus-Gone One’s feet. All your sufferings will be exhausted thereby.”

source: །དེ་ནས་ཀླུ་ཡི་དགས་ལྟ་བུ་དེ་དག་ཐམས་ཅད་ཀྱིས་ལག་པ་གཉིས་ཀྱིས་ཆུ་བླངས་པ་དང་། ལག་ན་ཆུ་འདུག་པ་དེ་རབ་ཏུ་འབར་རོ། །དེ་ནས་མེའི་ཕུང་པོ་ཤིང་ཏ་ལ་དྲུག་སྲིད་དུ་འཕགས་ཏེ།
en: The nāgas who were like pretas scooped up some water in their hands, but the water turned into blazing fire, and a mass of fire rose up in the air to a height of seven palm trees.

source: ལན་བདུན་གྱི་བར་དུ་དེ་བཞིན་ནོ།
en: This repeated seven times.
